Test/Fixtures/Refund/CreateResponse201.json

{
  "id": "a5810c4d-f5d6-4967-94ab-b09ed32c2910",
  "charge_id": "cf771e8a-5c1a-462f-b4c9-fc745f02d0de",
  "seller_id": "cf771e8a-5c1a-462f-b4c9-fc745f02d0de",
  "buyer_id": "cf771e8a-5c1a-462f-b4c9-fc745f02d0de",
  "currency": "USD",
  "status": "Created",
  "refund_memo_url": "string",
  "created": "2018-07-12T02:00:25.535Z",
  "modified": "2018-07-12T02:00:25.535Z",
  "total_amount": 100,
  "tax_amount": 10,
  "shipping_amount": 10,
  "shipping_tax_amount": 1,
  "shipping_tax_details": [
    {
      "tax_type": "string",
      "tax_rate": 10,
      "tax_amount": 1
    }
  ],
  "shipping_discount_amount": 0,
  "discount_amount": 0,
  "details": [
    {
      "sku": "SKU-123",
      "description": "An item",
      "quantity": 1,
      "unit_price": 90,
      "tax_amount": 9,
      "discount_amount": 0,
      "subtotal": 90,
      "tax_details": [
        {
          "tax_type": "10 Percent",
          "tax_rate": 10,
          "tax_amount": 9
        }
      ]
    }
  ],
  "refund_reason": "Delivery Refused",
  "refund_comment": "string"
}
