Test/Fixtures/Refund/GetResponse200.json

{
  "id": "cf771e8a-5c1a-462f-b4c9-fc745f02d0de",
  "seller_id": "cf771e8a-5c1a-462f-b4c9-fc745f02d0de",
  "buyer_id": "cf771e8a-5c1a-462f-b4c9-fc745f02d0de",
  "status": "Created",
  "currency": "USD",
  "total_amount": 1,
  "tax_amount": 0,
  "shipping_amount": 0,
  "shipping_tax_amount": 0,
  "shipping_tax_details": [
    {
      "tax_type": "string",
      "tax_rate": 10.4443,
      "tax_amount": -214748364
    }
  ],
  "shipping_discount_amount": 0,
  "discount_amount": 0,
  "foreign_exchange_fee": 0,
  "original_total_amount": 1,
  "paid_amount_currency": "USD",
  "paid_amount": 0,
  "refund_amount_currency": "USD",
  "refund_amount": 0,
  "order_url": "string",
  "invoice_url": "string",
  "order_number": "string",
  "po_number": "string",
  "previous_charge_id": "cf771e8a-5c1a-462f-b4c9-fc745f02d0de",
  "comment": "string",
  "supplier": {
    "company_name": "string",
    "company_address": {
      "address_line1": "1 Sample Street",
      "address_line2": "Unit 1234",
      "country": "US",
      "city": "Allgood",
      "state": "AL",
      "zip": "35013"
    }
  },
  "ship_to": {
    "recipient_name": "string",
    "company_name": "string",
    "company_address": {
      "address_line1": "1 Sample Street",
      "address_line2": "Unit 1234",
      "country": "US",
      "city": "Allgood",
      "state": "AL",
      "zip": "35013"
    },
    "pickup": false,
    "tracking": {
      "tracking_number": "string",
      "tracking_url": "string",
      "carrier": "string"
    }
  },
  "due_date": "2018-01-30T00:00:00.000Z",
  "created": "2018-07-12T02:00:25.535Z",
  "modified": "2018-07-12T02:00:25.535Z",
  "details": [
    {
      "sku": "string",
      "description": "string",
      "quantity": 0,
      "unit_price": -214748364,
      "tax_amount": -214748364,
      "discount_amount": -214748364,
      "subtotal": -214748364,
      "tax_details": [
        {
          "tax_type": "string",
          "tax_rate": 10.4443,
          "tax_amount": -214748364
        }
      ]
    }
  ],
  "metadata": [
    {
      "name": "string",
      "value": "string"
    }
  ],
  "cancellation_comment": "string",
  "cancellation_reason": "Delivery Refused",
  "return_comment": "string",
  "return_reason": "Delivery Refused",
  "dispute_comment": "string",
  "dispute_reason": "Buyer Does Not Recognize Charge",
  "buyer_currency": "USD",
  "buyer_total_amount": 1,
  "buyer_open_amount": 1,
  "buyer_payment_detail": [
    {
      "payment_id": "cf771e8a-5c1a-462f-b4c9-fc745f02d0de",
      "paid_amount": 0
    }
  ],
  "in_dispute": false,
  "charge_payment_days": 1
}
