Test/Fixtures/Refund/ListResponse200.json

[
  {
    "id": "a5810c4d-f5d6-4967-94ab-b09ed32c2910",
    "charge_id": "cf771e8a-5c1a-462f-b4c9-fc745f02d0de",
    "seller_id": "cf771e8a-5c1a-462f-b4c9-fc745f02d0de",
    "buyer_id": "cf771e8a-5c1a-462f-b4c9-fc745f02d0de",
    "currency": "USD",
    "status": "Created",
    "refund_memo_url": "string",
    "created": "2018-07-12T02:00:25.535Z",
    "modified": "2018-07-12T02:00:25.535Z",
    "total_amount": 1,
    "tax_amount": 0,
    "shipping_amount": 0,
    "shipping_tax_amount": 0,
    "shipping_tax_details": [
      {
        "tax_type": "string",
        "tax_rate": 10.4443,
        "tax_amount": -214748364
      }
    ],
    "shipping_discount_amount": 0,
    "discount_amount": 0,
    "details": [
      {
        "sku": "string",
        "description": "string",
        "quantity": 0,
        "unit_price": -214748364,
        "tax_amount": -214748364,
        "discount_amount": -214748364,
        "subtotal": -214748364,
        "tax_details": [
          {
            "tax_type": "string",
            "tax_rate": 10.4443,
            "tax_amount": -214748364
          }
        ]
      }
    ],
    "refund_reason": "Delivery Refused",
    "refund_comment": "string"
  }
]
